package by.epam.unit02.main;

public class Task01 {
    //Найдите значение функции: z = (a – 3 ) * b / 2 + c.

    public static void main(String[] args) {

        int a,b,c,z;// code convention - каждая переменная в отдельной строке

        a=4;
        b=6;
        c=10;

                z=(a-3)*b/2+c;//выравнивай код
                System.out.println("z = " + z);
    }
}
